docs/formal-scheduler-gap3/evidence/83-semantic-version-mutation.diff
--- target/gap3-evidence/83-semantic-version-mutation.original.rs.txt	2026-09-13 15:18:35.551740308 -0500
+++ crates/orchestration/peritus-scheduler/src/semantics.rs	2026-09-13 15:18:35.553740313 -0500
@@ -49,7 +49,7 @@
     {
         match schema_version {
             1 => Some(Self::LegacyQueueV1),
-            2 => Some(Self::StrictRecoveryQueueV2),
+            2 => Some(Self::LegacyQueueV1),
             _ => None,
         }
     }
